iaas/iaas-slamanager/planning-optimization/src/test/resources/soap/prova.xml

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Body><ns1:initiateNegotiation xmlns:ns1="http://webservice.syntaxconverter.gslam.slasoi.org"><slaTemplate>&lt;slam:SLATemplate xmlns:slam="http://www.slaatsoi.eu/slamodel">&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:UUID>ASCETiC-SLaTemplate-Example-01&lt;/slam:UUID>&lt;slam:ModelVersion>sla_at_soi_sla_model_v1.0&lt;/slam:ModelVersion>&lt;slam:Party>&lt;slam:Text/>&lt;slam:Properties>&lt;slam:Entry>&lt;slam:Key>http://www.slaatsoi.org/slamodel#gslam_epr&lt;/slam:Key>&lt;slam:Value>http://localhost:8080/services/asceticNegotiation?wsdl&lt;/slam:Value>&lt;/slam:Entry>&lt;/slam:Properties>&lt;slam:ID>AsceticProvider&lt;/slam:ID>&lt;slam:Role>http://www.slaatsoi.org/slamodel#provider&lt;/slam:Role>&lt;/slam:Party>&lt;slam:Party>&lt;slam:Text/>&lt;slam:Properties>&lt;slam:Entry>&lt;slam:Key>http://www.slaatsoi.org/slamodel#gslam_epr&lt;/slam:Key>&lt;slam:Value>http://localhost:8080/services/asceticNegotiation?wsdl&lt;/slam:Value>&lt;/slam:Entry>&lt;/slam:Properties>&lt;slam:ID>333&lt;/slam:ID>&lt;slam:Role>http://www.slaatsoi.org/slamodel#customer&lt;/slam:Role>&lt;/slam:Party>&lt;slam:InterfaceDeclr>&lt;slam:Text>Interface to specific OVF item&lt;/slam:Text>&lt;slam:Properties>&lt;slam:Entry>&lt;slam:Key>OVF_URL&lt;/slam:Key>&lt;slam:Value>ascetic-ovf-example.ovf&lt;/slam:Value>&lt;/slam:Entry>&lt;/slam:Properties>&lt;slam:ID>OVF-Item-ubu1&lt;/slam:ID>&lt;slam:ProviderRef>AsceticProvider&lt;/slam:ProviderRef>&lt;slam:Endpoint>&lt;slam:Text/>&lt;slam:Properties>&lt;slam:Entry>&lt;slam:Key>OVF_VirtualSystem_ID&lt;/slam:Key>&lt;slam:Value>ubu1&lt;/slam:Value>&lt;/slam:Entry>&lt;/slam:Properties>&lt;slam:ID>ubu1-VM-Type&lt;/slam:ID>&lt;slam:Location>VM-Manager ID&lt;/slam:Location>&lt;slam:Protocol>http://www.slaatsoi.org/slamodel#HTTP&lt;/slam:Protocol>&lt;/slam:Endpoint>&lt;slam:Interface>&lt;slam:InterfaceResourceType>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:Name>OVFAppliance&lt;/slam:Name>&lt;/slam:InterfaceResourceType>&lt;/slam:Interface>&lt;/slam:InterfaceDeclr>&lt;slam:AgreementTerm>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:ID>ubu1_Guarantees&lt;/slam:ID>&lt;slam:VariableDeclr>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:Var>VM_of_type_ubu1&lt;/slam:Var>&lt;slam:Expr>&lt;slam:ValueExpr>&lt;slam:FuncExpr>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:Operator>http://www.slaatsoi.org/coremodel#subset_of&lt;/slam:Operator>&lt;slam:Parameter>&lt;slam:ID>OVF-Item-ubu1&lt;/slam:ID>&lt;/slam:Parameter>&lt;/slam:FuncExpr>&lt;/slam:ValueExpr>&lt;/slam:Expr>&lt;/slam:VariableDeclr>&lt;slam:Guaranteed>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:State>&lt;slam:ID>CPU_CORES_for_ubu1&lt;/slam:ID>&lt;slam:Priority xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>&lt;slam:Constraint>&lt;slam:TypeConstraintExpr>&lt;slam:Value>&lt;slam:FuncExpr>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:Operator>http://www.slaatsoi.org/resources#vm_cores&lt;/slam:Operator>&lt;slam:Parameter>&lt;slam:ID>VM_of_type_ubu1&lt;/slam:ID>&lt;/slam:Parameter>&lt;/slam:FuncExpr>&lt;/slam:Value>&lt;slam:Domain>&lt;slam:SimpleDomainExpr>&lt;slam:ComparisonOp>http://www.slaatsoi.org/coremodel#equals&lt;/slam:ComparisonOp>&lt;slam:Value>&lt;slam:CONST>&lt;slam:Value>1&lt;/slam:Value>&lt;slam:Datatype>http://www.w3.org/2001/XMLSchema#integer&lt;/slam:Datatype>&lt;/slam:CONST>&lt;/slam:Value>&lt;/slam:SimpleDomainExpr>&lt;/slam:Domain>&lt;/slam:TypeConstraintExpr>&lt;/slam:Constraint>&lt;/slam:State>&lt;/slam:Guaranteed>&lt;slam:Guaranteed>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:State>&lt;slam:ID>MEMORY_for_ubu1&lt;/slam:ID>&lt;slam:Priority xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>&lt;slam:Constraint>&lt;slam:TypeConstraintExpr>&lt;slam:Value>&lt;slam:FuncExpr>&lt;slam:Text/>&lt;slam:Properties/>&lt;slam:Operator>http://www.slaatsoi.org/resources#memory&lt;/slam:Operator>&lt;slam:Parameter>&lt;slam:ID>VM_of_type_ubu1&lt;/slam:ID>&lt;/slam:Parameter>&lt;/slam:FuncExpr>&lt;/slam:Value>&lt;slam:Domain>&lt;slam:SimpleDomainExpr>&lt;slam:ComparisonOp>http://www.slaatsoi.org/coremodel#equals&lt;/slam:ComparisonOp>&lt;slam:Value>&lt;slam:CONST>&lt;slam:Value>256&lt;/slam:Value>&lt;slam:Datatype>http://www.slaatsoi.org/coremodel/units#MB&lt;/slam:Datatype>&lt;/slam:CONST>&lt;/slam:Value>&lt;/slam:SimpleDomainExpr>&lt;/slam:Domain>&lt;/slam:TypeConstraintExpr>&lt;/slam:Constraint>&lt;/slam:State>&lt;/slam:Guaranteed>&lt;/slam:AgreementTerm>&lt;/slam:SLATemplate></slaTemplate></ns1:initiateNegotiation></soapenv:Body></soapenv:Envelope>